<<<<<<< HEAD
# დავალება: შექმენით ფუნქცია, სახელად: reverse_list, ხოლო შემდეგ ფუნქცის დანიშნულება იქნება, შეიტანოთ ლისტი, და შემდეგ ეგ ლისტი დაგვიპრინტოს უკუღმა.

def reverse_list():
    
    list = [1 , 2 ,3 ,4 ,5 , 6]
    
    print(list[::-1])

=======
# დავალება: შექმენით ფუნქცია, სახელად: reverse_list, ხოლო შემდეგ ფუნქცის დანიშნულება იქნება, შეიტანოთ ლისტი, და შემდეგ ეგ ლისტი დაგვიპრინტოს უკუღმა.

def reverse_list():
    
    list = [1 , 2 ,3 ,4 ,5 , 6]
    
    print(list[::-1])

>>>>>>> 45e32c4c8a2c6cc07dd7d82997e10336990c06f1
reverse_list()