# კლასური სამუშაო 2: სიების ფუნქციები და მეთოდები  
# შექმენით სია სახელწოდებით numbers, რომელიც შეიცავს შემდეგ სრულ რიცხვებს: 10, 20, 30, 40, 50, 60, 70, 80, 90.  
# გამოიყენეთ append() ფუნქცია რიცხვის 100 დასამატებლად სიაში ბოლო ადგილზე.  
# გამოიყენეთ insert() ფუნქცია რიცხვის 5 დასამატებლად სიაში დასაწყისში.  
# გამოიყენეთ remove() ფუნქცია რიცხვის 30 ამოსაღებად სიიდან.  
# გამოიყენეთ sort() ფუნქცია სიას ზრდადი წესით დასალაგებლად.  
# გამოიყენეთ reverse() ფუნქცია სიების რიგის შეცვლისთვის.  
# გამოიყენეთ index() ფუნქცია რიცხვის 50 ინდექსის მოსაძიებლად.  
# გამოიყენეთ count() ფუნქცია, რომ დადგინოთ რამდენჯერ ჩნდება 20 სიაში.


# numbers = [10,20,30,40,50,60,70,80,90]

# numbers.append(100)

# numbers.insert(0,5)

# numbers.remove(30)

# numbers.sort()

# numbers.reverse()

# numbers.index(50)

# numbers.count(20)
# print(numbers)










# # საკლასო დავალება 2: ძირითადი სიის ოპერაციები
# შექმენით სია სახელწოდებით ხილი, რომელიც შეიცავს შემდეგ ელემენტებს: "ვაშლი", "ბანანი", "ალუბალი", "თარიღი" და "ელდერბერი".
# დაბეჭდეთ მთელი სია.
# წვდომა და დაბეჭდვა სიის პირველ და ბოლო ელემენტებზე.
# სიას დაამატეთ ახალი ხილი „ლეღვი“.
# ამოიღეთ „ბანანი“ სიიდან.
# შეცვალეთ მეორე ელემენტის მნიშვნელობა "მოცვი".
# ამობეჭდეთ სიის სიგრძე.
            # 0        1           2         3           4

# fruits = ["apple" , "banana" , "cherry" , "date" , "elderberry"]

# print(fruits)

# print(fruits[-0])

# print(fruits[-1]) # banana try removed

# fruits.append("Fig")
# print(fruits[-1])
# print(fruits[-2])

# fruits.append(2)
# print(fruits)








# 4)საკლასო დავალება 3: დაჭრა და სიის გააზრება

# შექმენით რიცხვების სია, რომელიც შეიცავს მთელ რიცხვებს 1-დან 10-მდე.

# გამოიყენეთ სიის დაჭრა ახალი სიის შესაქმნელად, სახელად first_half, რომელიც შეიცავს რიცხვებიდან 

# პირველ ხუთ ელემენტს.

# გამოიყენეთ სიის დანაწევრება მეორე სიის შესაქმნელად, სახელად second_half, რომელიც შეიცავს ბოლო 

# ხუთ ელემენტს რიცხვებიდან.

# გამოიყენეთ სიის გააზრება ახალი სიის შესაქმნელად, სახელად კვადრატები, რომელიც შეიცავს 

# რიცხვების სიაში თითოეული ნომრის კვადრატებს.

# დაბეჭდეთ სამივე სია: პირველი_ნახევარი, მეორე_ნახევარი და კვადრატები.


# lst = [1,2,3,4,5,6,7,8,9,10]

# first_half=lst[:5]

# print(first_half)

# second_half =lst [-5:]
# print(second_half)

# squares = [1,4,7,9]
# squares = [x**2 for x in squares]
# print(squares)


# for i in range i ცვლადიდან დიაპაზონში


# 5) საკლასო დავალება 5: სიის მანიპულირება და აგრეგაცია

# 1. შექმენით სია სახელად ტემპერატურა, რომელიც შეიცავს შემდეგ მნიშვნელობებს, რომლებიც წარმოადგენს ყოველდღიურად

# ტემპერატურა: [72, 68, 75, 70, 78, 74, 71].

# 2. გამოთვალეთ და დაბეჭდეთ უმაღლესი ტემპერატურა max() ფუნქციის გამოყენებით.

# 3. გამოთვალეთ და ამობეჭდეთ ყველაზე დაბალი ტემპერატურა min() ფუნქციის გამოყენებით.

# 4. გამოთვალეთ და ამობეჭდეთ საშუალო ტემპერატურა sum() ფუნქციის გამოყენებით სიის სიგრძეზე გაყოფილი.

# 5. გამოიყენეთ სიის გააზრება ახალი სიის შესაქმნელად, სახელწოდებით above_70, რომელიც შეიცავს მხოლოდ 70 გრადუსზე ზემოთ ტემპერატურას.

# 6. ამობეჭდეთ ზემოთ_70 სია.




temperature = [72, 68, 75, 70, 78, 74, 71]

print(max(temperature))


print(min(temperature))


print(sum(temperature)/len(temperature))


above_70 = [75,80,85]

print(*above_70)
