
# პრაქტიკული სავარჯიშო

# საძიებო სისტემა

# თქვენ მუშაობთ საძიებო სისტემაზე - ფრთხილად Google!

# მოცემული კოდი იღებს ტექსტსა და სიტყვას როგორც შემავალ მონაცემებს და გადასცემს მათ 

# ფუნქციას, რომელსაც ჰქვია search().

# search() ფუნქციამ უნდა დააბრუნოს "სიტყვა ნაპოვნია" თუ სიტყვა არსებობს ტექსტში, ან 

# 
# "სიტყვა ვერ მოიძებნა", თუ ის არ არის.

# საცდელი შემავალი მონაცემები:

# "ეს არის შესანიშნავი"

# "შესანიშნავი"

# საცდელი გამომავალი მონაცემები:

# სიტყვა ნაპოვნია

text = input("choose you book")
search = input("სიტყვა ნაპოვნია")