# # # მარტივი ოპერაციები
# # # ოდესმე გაინტერესებთ რამდენი წამია დღეში
# # # მოდით გამოვთვალოთ!

# # # დავალება
# # # დაწერეთ პროგრამა, რომელიც გამოთვლის და გამოსცემს პასუხს
# # # მინიშნება
# # # დაიმახსოვრე, დღეში 24 საათია, საათში 60 წუთი და წუთში 60 წამი

day = 24 # in day is 24 hour
hours = 60 # in hours is 60 minutes
# # minutes = 60# in minutes is 60 seconds

# # print(day + hours + minutes)


# # # პრაქტიკული სავარჯიშო

# # # 
# # # 
# # # ფასის პროგრამა
# # # # წარმოიდგინეთ, რომ უნდა შექმნათ პროგრამა მაღაზიისთვის, რომელიც ასახავს ნივთის ფასს.
# # # მოცემული პროგრამა შექმნილია საჩვენებლად ფასი: 87$# მაგრამ არასრულია.
# # # ამოცანა:
# # # შეავსეთ კოდი საჭირო შეტყობინების გამოსაჩენად.
# # # მე# გახსოვდეთ, რომ თქვენ უნდა ჩართოთ ყველა მნიშვნელობა ბრჭყალებში.
# # # გაიჭედა?
# # # PY
# # # 1
# # # ბეჭდვა ("ფასი:
# # # კოდის გადატვირთვა
# # # გაშვება

price = 87#$
print(price)

# # #პრაქტიკული სავარჯიშო

# # # ქულის გამოტანა
# # #მოცემული კოდი შექმნილია იმისთვის, რომ აჩვენოს მომხმარებლის მეტსახელი და ქულები ვიდეო
# # # თამაშში. უნდა გამოვიდეს:
# # # მეტსახელი: ოსტატი
# # # ქულა: 99
# # # მაგრამ რაღაც არასწორია. შეგიძლია გაასწორო?
# # # დავალება
# # # დააფიქსირეთ კოდი საჭირო გამოსავლის შესაქმნელად.
# # # მე
# # # ყურადღება მიაქციეთ, რომ წერტილის შემდეგ არის სივრცე.
# # # გაიჭედა?
# # # PY
# # # 1
# # # ბეჭდვა ("მეტსახელი", "ოსტატი")
# # # 2 ბეჭდვა ("ქულა", 99)
# # # დააწკაპუნეთ რედაქტირებისთვის|
# # # კოდის გადატვირთვა
# # # გაშვება
name = "ostat"
score = 99
print(name)
print(score)

# # #პრაქტიკული სავარჯიშო

# # # ფიფქის დახატვა

# # # მოცემული კოდი შექმნილია ამ ფიფქის დასახატავად
# # # *
# # # ***
# # # ***
# # # *
# # # მაგრამ რაღაც არასწორია. შეგიძლია გაასწორო?
# # # დავალება
# # # შეცვალეთ კოდი მოსალოდნელი გამოსავლის საჩვენებლად.
# # # PY
# # # 1

snowflake = "*"
print(snowflake)




# # #პრაქტიკული სავარჯიშო
# # # ქვეყნის ბარათები
# # # თქვენ უნდა გააკეთოთ პროგრამა ქვეყნის ბარათების შესაქმნელად, რომლებშიც გამოსახულია ქვეყნის და დედაქალაქის სახელები.
# # # დავალება
# # # შეავსეთ კოდი, რომ აიღოთ ქვეყანა და კაპიტალი, როგორც შეყვანის სახით და მიიღოთ გამოსავალი, რომელიც მოცემულია ქვემოთ მოცემულ მაგალითში
# # # შეყვანის მაგალითი
# # # პორტუგალია
# # # ლისაბონი
# # # გამომავალი მაგალითი
# # # ქვეყანა: პორტუგალია
# # # დედაქალაქი: ლისაბონი
# # # გაითვალისწინეთ სივრცე მსხვილი ნაწლავის შემდეგ.
# # # გაიჭედა?
# # # PY
# # # 1
# # # 2
# # # 3
# # # #თქვენი კოდი მიდის აქ
# # # 4
# # # ბეჭდვა ("ქვეყანა:")
# # # 5
# # # ბეჭდვა ("კაპიტალი:")
# # # დააწკაპუნეთ რედაქტირებისთვის|
# # # კოდის გადატვირთვ
# # # გაშვება

city_card = "country"
portugal = "Lisabon"
country = "Portugal"
capital = "Lisabon"
print(city_card)
print(portugal)
print(country)
print(capital)



wins = int (input("Enter the number of wins: "))
ties = int (input("Enter the number of ties: "))

print(ties * 0.5 + wins * 1)

balance = int(input("enter your balance"))
remove = int(input("enter your remove"))
print(100 % 30)

# # დაწერეთ პროგრამა მგზავრების ასაკის შესაყვანად 
# # და გამოსავალზე "Take your kindle!" თუ ასაკი
# # არის 19 წლამდე ან ტოლი
age =int (input("Enter your age"))#მგზავრების ასაკი
if age == 19:
    print("Take your kindle")
elif age > 18:
    print("you can take kindle")
else:
    print("ახლა უფრო მეტის აღება შეგიძლია")
# # დაასრულეთ პროგრამა, რომ გამოსულიყო შესაბამისი ველი მოცემულ ფორმატში შეუსაბამო ფერის შემთხვევაში, პროგრამამ უნდა გამოსულიყო
color1 = input("Enter your favorite color")
if color1 == 'red':
    print("box #1")
elif color1 == 'green':
    print('box #2')
elif color1 == "black":
    print("box #3")
    

day = str(input("enter day :"))
hours = int(input("enter your time :"))
work0 = 10#დან 21
work1 = 21#საათამდე
if work0 == 10:
    print("მაღაზია ღიაა")
elif work1 == 21:
    print("ღია")
else:
    print("მაღაზია დაკეტილია")
    კვირის_დღეები = "არ ვმუშაობთ"
    if კვირის_დღეები == "არ ვმუშაობთ":
        print("მაღაზია დაკეტილია")        

# # დაასრულეთ პროგრამა, რომ აიღოთ 3 რიცხვი, როგორც შემავალი
# # და გამომავალი ასო მასივიდან, რომლებიც შეესაბამება ამ ინდექსებს.

#list
lst = ["A" , "B" , "C" , "D" , "E" , "F" , "G" , "H" , "I" , "J" , "K" , "L" , "M" , "N" , "O" , "P" , "Q" , "R" , "S" , "T" , "U" , "V" , "W" , "X", "Y", "Z"]
print(lst[0])
print(lst[1])
print(lst[2])

voice = input("enter ur voice")
Sustainable = "OK"
noun = "NO"

if Sustainable == "OK":
    print("ბრძანება მუშაობს")
elif noun == "NO":
    print("არ მუშაობს")
    Headlights = "OFF"
    if Headlights == "OFF":
        print("look it up")
        open = "door"
    elif open == "door":
        print("გააღე კარი ყავა გააკეთე დახურე")
           


# სართულების_რაოდენობა = input("შეიყვანე სართულების რაოდენობა")
# print(5-10)

mile = 550
fly = 550
print(fly / mile)

price = int(input("enter your price"))
buy = 13#$
if price < buy:
    print("you can out afford")
else:
    print(price / buy)
