#დავალება 5: ქვე-სტრინგების შეცვლა შექმენით სტრინგი სახელად quote შემდეგი შინაარსით: “To be or not to be, that is the question.” გამოიყენეთ replace() ფუნქცია სიტყვა “be”-ის შესაცვლელად “code”-ით. შედეგი შეინახეთ ცვლადში სახელად modified_quote და დაბეჭდეთ იგი
quote = 'To be or not to be that is the question'
print(quote.replace("be","code"))# პირველი მნიშვნელობა არის რა სიტყვის შეცვლა გვინდა==========================================================================================
# ხოლო მეორე მნიშვნელობა არის რითი გვინდა ჩავანაცვლოთ პირველი სიტყვა ანუ შევცვალოთ
