# 3) დავალება
#  'FizzBuzz' 

# FizzBuzz მიზანი:

#  შექმენით პროგრამა, რომელიც ბეჭდავს რიცხვებს 1-დან 100-მდე. თუმცა 3-ის ჯერადებისთვის რიცხვის ნაცვლად დაბეჭდეთ „Fizz“, ხოლო 5-ის ჯერადებისთვის დაბეჭდეთ „Buzz“. 3-ისა და 5-ის ჯერადი რიცხვებისთვის დაბეჭდეთ "FizzBuzz".  მოთხოვნები: გამოიყენეთ მარყუჟი 1-დან 100-მდე რიცხვების გასამეორებლად.
# გამოიყენეთ პირობითი განცხადებები, რათა შეამოწმოთ რიცხვი იყოფა 3-ზე, 5-ზე ან ორივეზე. 
# დაბეჭდეთ შესაბამისი სიტყვა ("Fizz", "Buzz" ან "FizzBuzz") ან ნომერი. 
# ბატონი დავით ჯანეზაშვილი — 07/31/2024 11:32 PM

for i in range(0,101,3):
    print(i,"Fizz")

for i in range(0,101,5):
    print(i, "Buzz")

for i in range(0,101,8):
    print(i, "FizzBuzz")