lst = [1,2,3,4,5,6,7,8,9,10]
print(lst[:5])

print(lst[:-1])

print(lst[:5],lst[4:11])





#: გამოიყენება იმისათვის რომ ელემენტის 1 წერტილიდან მეორე წერტილამდე დაპრინტო ყველა სიის ელემენტი

#:: გამოიყენება პირველს და ბოლო ელემენტს პრინტავს დაპრინტავს პირველს და მეორეს


# შექმენით 10 მთელი რიცხვების სია, რიცხვები, 1-დან 10-მდე.


# დაჭერით სია, რომ მიიღოთ პირველი 
# 5 ელემენტი და დაბეჭდეთ ისინი.

# დაჭერით სია ბოლო 3 ელემენტის მისაღებად 
# და დაბეჭდეთ ისინი.

# დაჭერით სია, რომ მიიღოთ ყოველი მეორე 
# ელემენტი სიიდან და დაბეჭდეთ იგი.