# 2) შექმენით სია
#  და შეიტანეთ
#  10 სხვადასხვა მონაცემთა ტიპის მნიშვნელობა
# , შემდეგ 5 მონაცემ
# ს  შეუცვალეთ   მნიშვნელობა
#  და შემდეგ დაპრინტეთ მთლიანი სია.

lists = ["1.2 ,  , 13 , True , False , 10 + 10 , - 2 , 5 * 1 , 5 / 1 , 11 / 2"]
lists.insert(-2, "GIGA")
print(lists)


# 3) სიაში ელემენტების ჯამი
# შექმენი სია, რომელიც შეიცავს
#  რიცხვებს.#შესრულებულია დაწერე კოდი
# , რომელიც გამოითვლის
#  ამ სიის ელემენტების ჯამს
#  და დაბეჭდავს შედეგს.

lists = [1,2,3,4,5,6,7,8,9,10,11]
print(sum(lists))

#4) სიის ყველა ელემენტის გაორმაგება
# შექმენი სია რიცხვებით.
#  დაწერე კოდი
# , რომელიც თითოეული
#  ელემენტის გაორმაგებულ
#  მნიშვნელობას შეიცავს
#  ახალ სიაში და
#  დაბეჭდავს მას.
lists = [1,2,3,4,5,6,7,8,9,10]
რიცხვების_გაორმაგება =[giga * 2 for giga in lists]
print(რიცხვების_გაორმაგება)

# 5) სიის ელემენტების გამრავლება
# შექმენი სია
#  რიცხვებით
#  და დაწერე კოდი,
#  რომელიც გამოითვლის სიის
#  ყველა ელემენტის ნამრავლს
#  და დაბეჭდავს შედეგს.

lists = [1,2,3,4,5,6,7,8,9,10]
num = 10
print(num * 10)

