# #1) მომხმარებელს შემოატანინეთ 4 სხავდასხვა რიცხვი და ამ ოთხივე რიცხვზე მოახდინეთ არითმეტიკური ოპერაციები. +,-,*,//
# num = int(input("Enter your number"))
# print(5 + 1)
# print(5 + 2)
# print(5 + 3)
# print(5 + 4)
# print(5 + 5)

# print(5 - 2)
# print(5 - 2)
# print(5 - 2)
# print(5 - 2)
# print(5 - 2)

# print(5 * 2)
# print(5 * 2)
# print(5 * 2)
# print(5 * 2)
# print(5 * 2)

# print(5 // 2)
# print(5 // 2)
# print(5 // 2)
# print(5 // 2)
# print(5 // 2)

# #2) დაწერეთ პროგრამა სადაც შემოიტანთ თქვენი ოჯახის წევრების ასაკს და გამოიტანეთ ის თუ რამდენი წლის იქნებიან 20 წლის შემდეგ
# num = int(input("შეიყვანე მშობლის ასაკი"))
# print("მამაჩემი იქნება 20 წლის შემდეგ 68 წლის")
# num = int(input("შეიყვანე მშობლის ასაკი"))
# print("დედაჩემი იქნება 20 წლის შემდეგ 64 წლის")

# #3) შექმენით ცვლადები სადაც შეინახავთ თქვენს თავზე ინფორმაციას (სახელი, გვარი, ასაკი, ქვეყანა, ქალაქი, საყვარელი ფერი, საყვარელი მანქანა, საყვარელი საჭმელი, საყვარელი სპორტი და ა.შ) შემდეგ შემოტანილი მნიშვნელობებით ააწყვეტ ერთი დიდი წინადადება.
# name = "Giga"
# lastname = "Khutsisvhili"
# age = 16
# country = "Georgia"
# City = "Kvareli"
# color = "Green"
# car = "Mercedes Benz"
# Food = "Khinkali and a barbecue"
# sport = "Football"
# print("name lastname age country city color car food sport")

# #4)დაწერეთ მარტივი პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს თავისი სახელი და შემდეგ დაბეჭდოს მისალოცი შეტყობინება მათი სახელის გამოყენებით.
# name = str(input("Enter your name"))
# print("Happy birthday")

#5) დაწერეთ პითონის პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს ორი რიცხვი და შემდეგ დაბეჭდოს მათი ჯამი.
# num = int(input("Enter number"))
# sum = 5
# sum = 2
# print(sum + sum)

#6)დაწერეთ პითონის პროგრამა, რომელიც ითვლის მართკუთხედის ფართობს. პროგრამამ უნდა სთხოვოს მომხმარებელს მართკუთხედის სიგანე და სიმაღლე.
# height = int(input("Enter your width"))
# width = int(input("Enter your height"))
# print(height + width)

#7) დაწერეთ პითონის პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს რიცხვი და შემდეგ დაბეჭდოს ამ რიცხვის ორმაგი.
# num = int(input("Enter your number"))
# print(num + num)

#8)დაწერეთ პითონის პროგრამა, რომელიც ითვლის მართკუთხედის პერიმეტრს. პროგრამამ უნდა სთხოვოს მომხმარებელს მართკუთხედის სიგანე და სიმაღლე.
# width = int(input("please Enter your width"))
# height = int(input("please Enter your height"))
# print(width + height)

# 9) დაწერეთ პითონის პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს რიცხვი და შემდეგ დაბეჭდოს ამ რიცხვის კვადრატი(გამოიყენეთ ** - ოპერატორი)
num = int(input("Enter your number"))
print(num ** num)