# # ამოცანა 1: სტრიქონების ფორმატირება

# შექმენით სტრიქონი სახელად შაბლონი შემდეგი შინაარსით: "გამარჯობა, {name}. მოგესალმებით {place}-ში."

# # გამოიყენეთ format() ფუნქცია, რომ შეცვალოთ {name} „ალისით“ და {place} „საოცრებათა ქვეყანა

# “-ით. შეინახეთ შედეგი ცვლადში სახელად formatted_string და დაბეჭდეთ.

template = "Hello template. მოგესალმებით place-ში"
print(template.format(("name" ,  "alis" "place"  "Wonderland")))
# პრაქტიკული სავარჯიშოა და ვეცადე ისეთი გამომსვლოდა როგორც პირობაშია მოცემული.