sent = "#"
print(sent.replace("#" , "hey"))
# # პრაქტიკული სავარჯიშო

# სიმებიანი ფუნქციები

# თქვენმა მეგობარმა გამოგიგზავნათ შეტყობინება, თუმცა მისი კლავიატურა გატეხილია და ინტერვალის ნაცვლად აკრიფებს #-ს.

# შეცვალეთ ყველა # სიმბოლო მოცემულ შეყვანში ინტერვალით და გამოიტანეთ შედეგი.

# მე

# თქვენ შეგიძლიათ გამოიყენოთ სტრიქონის ჩანაცვლება() ფუნქცია ერთი ქვესტრიქონის მეორეთი შესაცვლელად.

# გაიჭედა?

# PY

# 1 msg = შეყვანა ()

# 2

# დააწკაპუნეთ რედაქტირებისთვის|

# კოდის გადატვირთვა

# გაშვება

