width = int (input("enter width"))
length = int (input("enter length"))
print(width * length)
def area(length,width):
    return length,width

result = 15600
# # დაბრუნება
# ჩვენ უნდა გამოვთვალოთ მოცემული მართკუთხედის ფართობი.

# თქვენმა პროგრამამ უნდა აიღოს სიგანე და სიგრძე, როგორც შეყვანა და გამოიტანოს მართკუთხედის ფართობი.

# შეავსეთ ფართობის ფუნქცია, რომელიც არგუმენტად იღებს სიგრძეს და სიგანეს, რათა გამოვთვალოთ და დააბრუნოთ ფართობი.

# შემდეგ გამოიძახეთ ფუნქცია მოცემული შეყვანისთვის.