# საკლასო სამუშაო:


# 1)შექმენით სია, შეიტანეთ 5 მნიშვნელობა, შემდეგ 3 მნიშვნელობა შეცვალეთ და გამოიტანეთ სია.
# 2) შექმენით რიცხვების სია და ერთამენთს დაუმატეთ და გამოიტანეთ საბოლოო ჯამი.
# 3) შექმენით სტრინგების სია, გადაეცით 6 სიტყვა და შემდგომ ეს სიტყვები დაუმატეთ ერთმანეთს და გამოიტანეთ ფრაზა.

lists = [1.3 , 1 , True , False , "g"]
lists.insert(1 , "Hello")
print(lists)


list0 = [1,2,3,4,5,6,7,8,9,10,11]

print(sum(list0))

list = ["G" "O" "A" "Gi" "ga" "ap" "ll" "e" ]
print(list + list)